Documents/ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Векселя</v8:Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
						<v8:Type>cfg:CatalogRef.Паи</v8:Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбытиеПоБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбытиеПоНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбытиеПоЕПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчетЕПС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Единый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/БухПартииЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>БухПартииЦенныхБумаг</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьПокупки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьПокупкиКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыПриПокупкеВСтоимости</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыПриПокупкеВСтоимостиВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыПриПокупкеСНачалаГода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаВСтоимости</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаКупонаВСтоимости</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьКупонаВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переоценка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаСНачалаГода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаСНачалаГодаПоложительная</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаКупонаВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаКупонаСНачалаГода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДисконтПремия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДисконтПремияПокупки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДисконтПремияНачисленный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДисконтПремияНачисленныйВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДисконтПремияНачисленныйСНачалаГода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорректировкаЭСП</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорректировкаЭСПВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорректировкаЭСПСНачалаГода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазницаПервоначальногоПризнанияСНачалаГода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЧастичногоПогашения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРезервовПодОбесценение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРезервовПодОбесценениеКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРезервовПоСомнительнымДолгам</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсовыеРазницыСНачалаГода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндексацияНоминала</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндексацияНоминалаСНачалаГода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндексацияНоминалаЗаВремяВладения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПогашениеКупонаНеИсполненноеВСрок</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗадолженностьПоПогашениюТела</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗадолженностьПоПогашениюТелаВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗадолженностьПоПогашениюКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗадолженностьПоПогашениюКупонаВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтрокаКорзиныЦенныхБумаг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПогрешностиОкругления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетныйАктивЕПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БухгалтерскийУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиныйБухгалтерскийУчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету/Ext/ManagerModule.bsl
Процедура СформироватьПроводкуВыбытияСтоимостиБумаги(Объект, Движения, ДанныеБумаги, ДанныеКорСчета, ЧастьСтоимости)
	
	Если ДанныеБумаги.Сумма = 0 И ДанныеБумаги.СуммаВВалютеУчета = 0 И ДанныеБумаги.Количество = 0 Тогда
		Возврат;	
	КонецЕсли;

	ОснованиеРасчетов = Неопределено;	
	
	Если ДанныеБумаги.СуммаВВалютеУчета >= 0 Тогда
	
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(Объект, Движения, ДанныеБумаги.СуммаВВалютеУчета, "Выбытие стоимости ценной бумаги (" + ЧастьСтоимости + ")");
		
		// дебет
		Проводка.СчетДт = ДанныеКорСчета.КоррСчет;
		Для НомСубк = 1 По ДанныеКорСчета.КоррСчет.ВидыСубконто.Количество() Цикл
			Проводка.СубконтоДт[ДанныеКорСчета.КоррСчет.ВидыСубконто[НомСубк - 1].ВидСубконто] = ДанныеКорСчета["Субконто" + НомСубк];
		КонецЦикла;
		
		// кредит
		Проводка.СчетКт = ДанныеБумаги.СчетУчета;
		Проводка.СубконтоКт[ДанныеБумаги.СчетУчета.ВидыСубконто[0].ВидСубконто] = ДанныеБумаги.ЦеннаяБумага;
		
		Если ДанныеБумаги.Свойство("ОснованиеРасчетов", ОснованиеРасчетов) Тогда
			Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов] = ДанныеБумаги.ОснованиеРасчетов;
		КонецЕсли;
		
		Если ДанныеБумаги.СчетУчета.Количественный И ДанныеБумаги.Количество <> 0 Тогда
			Проводка.КоличествоКт = ДанныеБумаги.Количество;
		КонецЕсли;
		
		Если ДанныеБумаги.СчетУчета.Валютный И ДанныеБумаги.Сумма <> 0 Тогда
			Проводка.ВалютаКт = ДанныеБумаги.Валюта;
			Проводка.ВалютнаяСуммаКт = ДанныеБумаги.Сумма;
		КонецЕсли;
		
	Иначе
	
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(Объект, Движения, ДанныеБумаги.СуммаВВалютеУчета, "Выбытие стоимости ценной бумаги (" + ЧастьСтоимости + ")");
		
		// дебет
		Проводка.СчетДт = ДанныеБумаги.СчетУчета;
		Проводка.СубконтоДт[ДанныеБумаги.СчетУчета.ВидыСубконто[0].ВидСубконто] = ДанныеБумаги.ЦеннаяБумага;
		
		Если ДанныеБумаги.Свойство("ОснованиеРасчетов", ОснованиеРасчетов) Тогда
			Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов] = ДанныеБумаги.ОснованиеРасчетов;
		КонецЕсли;
		
		Если ДанныеБумаги.СчетУчета.Валютный И ДанныеБумаги.Сумма <> 0 Тогда
			Проводка.ВалютаДт = ДанныеБумаги.Валюта;
			Проводка.ВалютнаяСуммаДт = ДанныеБумаги.Сумма;
		КонецЕсли;
		
		// кредит
		Проводка.СчетКт = ДанныеКорСчета.КоррСчет;
		Для НомСубк = 1 По ДанныеКорСчета.КоррСчет.ВидыСубконто.Количество() Цикл
			Проводка.СубконтоК[ДанныеКорСчета.КоррСчет.ВидыСубконто[НомСубк - 1].ВидСубконто] = ДанныеКорСчета["Субконто" + НомСубк];
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПроводкуВыбытияСтоимостиБумагиЕПС(Объект, Движения, ДанныеБумаги, ДанныеКорСчета, ЧастьСтоимости)

	Если ДанныеБумаги.СуммаВВалютеУчета = 0 И ДанныеБумаги.Сумма = 0 И ДанныеБумаги.Количество = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеБумаги.СуммаВВалютеУчета >= 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(Объект, Движения, ДанныеБумаги.СуммаВВалютеУчета, "Выбытие стоимости ценной бумаги (" + ЧастьСтоимости + ")");
		
		// дебет
		Проводка.СчетДт = ДанныеКорСчета.КоррСчетЕПС;
		Для НомСубк = 1 По ДанныеКорСчета.КоррСчетЕПС.ВидыСубконто.Количество() Цикл
			Проводка.СубконтоДт[ДанныеКорСчета.КоррСчетЕПС.ВидыСубконто[НомСубк - 1].ВидСубконто] = ДанныеКорСчета["СубконтоЕПС" + НомСубк];
		КонецЦикла;
		
		// кредит
		Проводка.СчетКт = ДанныеБумаги.СчетУчета;
		
		Проводка.СубконтоКт.ЦенныеБумаги = ДанныеБумаги.ЦеннаяБумага;
		
		Проводка.КоличествоКт = ДанныеБумаги.Количество;
		
		Проводка.ВалютаКт = ДанныеБумаги.Валюта;
		Проводка.ВалютнаяСуммаКт = ДанныеБумаги.Сумма;
		
		Проводка.ДополнительнаяАналитикаКт = ДанныеБумаги.ДополнительнаяАналитика;
		
	Иначе
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(Объект, Движения, -ДанныеБумаги.СуммаВВалютеУчета, "Выбытие стоимости ценной бумаги (" + ЧастьСтоимости + ")");
		
		// дебет
		Проводка.СчетДт = ДанныеБумаги.СчетУчета;
		
		Проводка.СубконтоДт.ЦенныеБумаги = ДанныеБумаги.ЦеннаяБумага;
		
		Проводка.КоличествоДт = ДанныеБумаги.Количество;
		
		Проводка.ВалютаДт = ДанныеБумаги.Валюта;
		Проводка.ВалютнаяСуммаДт = -ДанныеБумаги.Сумма;
		
		Проводка.ДополнительнаяАналитикаДт = ДанныеБумаги.ДополнительнаяАналитика;
		
		// кредит
		Проводка.СчетКт = ДанныеКорСчета.КоррСчетЕПС;
		Для НомСубк = 1 По ДанныеКорСчета.КоррСчетЕПС.ВидыСубконто.Количество() Цикл
			Проводка.СубконтоКт[ДанныеКорСчета.КоррСчетЕПС.ВидыСубконто[НомСубк - 1].ВидСубконто] = ДанныеКорСчета["СубконтоЕПС" + НомСубк];
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура СформироватьПроводкиВыбытияСтоимостиБумагиЕПС(Объект, Движения, УчетныйРегистр, Отказ) Экспорт

	ВалютаУчета = Объект.Организация.ВалютаУчета;
	
	ДанныеКорСчета = Новый Структура("КоррСчетЕПС, СубконтоЕПС1, СубконтоЕПС2, СубконтоЕПС3");
	ЗаполнитьЗначенияСвойств(ДанныеКорСчета, Объект);
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.СнятиеЦеннойБумагиСУчета") // этот всегда списывает на реализацию
		ИЛИ Объект.КоррСчетЕПС = ПланыСчетов.Единый.ВыбытиеИРеализация10 Тогда // а у этого проставим, если не меняли дефолтный счет
		
		ДанныеКорСчета.КоррСчетЕПС = ПланыСчетов.Единый.ВыбытиеИРеализация10;
		ДанныеКорСчета.СубконтоЕПС1 = Объект.ЦеннаяБумага;
		ДанныеКорСчета.СубконтоЕПС2 = Объект.Ссылка;
	
	КонецЕсли;
	
	ДанныеБумаги = Новый Структура("ЦеннаяБумага, СчетУчета, ДополнительнаяАналитика, Сумма, СуммаВВалютеУчета, Количество, Валюта, Эмитент, Контрагент");
	ДанныеБумаги.ЦеннаяБумага = Объект.ЦеннаяБумага;
	ДанныеБумаги.Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеБумаги.ЦеннаяБумага, "ВалютаНоминала");
	ДанныеБумаги.Эмитент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеБумаги.ЦеннаяБумага, "Эмитент");
	ДанныеБумаги.Контрагент	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеБумаги.Эмитент, "ЮрФизЛицо");
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	ОтражатьПартииНаЛицевыхСчетах = БухгалтерскийУчет.ОпределитьНастройкуУчета(
		Объект.Дата,
		Объект.Организация,
		Объект.СчетДоверительногоУправления,
		"ОтражатьПартииНаЛицевыхСчетах");	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.Партия КАК Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	СУММА(БухПартииЦенныхБумаг.Количество) КАК Количество,
		|	СУММА(БухПартииЦенныхБумаг.Стоимость) КАК Стоимость,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьВВалютеУчета) КАК СтоимостьВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьКупона) КАК СтоимостьКупона,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета) КАК СтоимостьКупонаВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.Переоценка) КАК Переоценка,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета) КАК ПереоценкаВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаКупона) КАК ПереоценкаКупона,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета) КАК ПереоценкаКупонаВВалютеУчета,
		|	СУММА(ВЫБОР
		|			КОГДА БухПартииЦенныхБумаг.ДисконтПремия >= 0
		|				ТОГДА БухПартииЦенныхБумаг.ДисконтПремияНачисленный
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПремияНачисленная,
		|	СУММА(ВЫБОР
		|			КОГДА БухПартииЦенныхБумаг.ДисконтПремия >= 0
		|				ТОГДА БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПремияНачисленнаяВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.КорректировкаЭСП) КАК КорректировкаЭСП,
		|	СУММА(БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета) КАК КорректировкаЭСПВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	СУММА(БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.СуммаРезервовПодОбесценение) КАК СуммаРезервовПодОбесценение,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Резерв,
		|	СУММА(БухПартииЦенныхБумаг.ПогашениеКупонаНеИсполненноеВСрок) КАК ПогашениеКупонаНеИсполненноеВСрок,
		|	СУММА(БухПартииЦенныхБумаг.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета) КАК ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета,
		|	СУММА(ВЫБОР
		|			КОГДА БухПартииЦенныхБумаг.ДисконтПремия >= 0
		|				ТОГДА 0
		|			ИНАЧЕ БухПартииЦенныхБумаг.ДисконтПремияНачисленный
		|		КОНЕЦ) КАК ДисконтНачисленный,
		|	СУММА(ВЫБОР
		|			КОГДА БухПартииЦенныхБумаг.ДисконтПремия >= 0
		|				ТОГДА 0
		|			ИНАЧЕ БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета
		|		КОНЕЦ) КАК ДисконтНачисленныйВВалютеУчета
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет В
		|					(ВЫБРАТЬ
		|						Справочник.УчетныеАктивыЕПС.СчетУчетаРезервов
		|					ИЗ
		|						Справочник.УчетныеАктивыЕПС),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ПО БухПартииЦенныхБумаг.ЦеннаяБумага = ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС,
		|	БухПартииЦенныхБумаг.Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто2";
	
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведение по регистрам бухгалтерии не возможно, т.к. движения по партиям не сформированы",,,, Отказ);
		Возврат;
	КонецЕсли;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		// тело
		ДанныеБумаги.СчетУчета = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета;
		ДанныеБумаги.ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
		ДанныеБумаги.Сумма = ВыборкаДетальныеЗаписи.Стоимость;
		ДанныеБумаги.СуммаВВалютеУчета = ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета;
		ДанныеБумаги.Количество = ВыборкаДетальныеЗаписи.Количество;
		СформироватьПроводкуВыбытияСтоимостиБумагиЕПС(Объект, Движения[УчетныйРегистр], ДанныеБумаги, ДанныеКорСчета, "тело");
		
		ДанныеБумаги.Количество = 0;
		
		// дисконт
		ДанныеБумаги.СчетУчета = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета;
		ДанныеБумаги.ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт;
		ДанныеБумаги.Сумма = ВыборкаДетальныеЗаписи.ДисконтНачисленный;
		ДанныеБумаги.СуммаВВалютеУчета = ВыборкаДетальныеЗаписи.ДисконтНачисленныйВВалютеУчета;
		СформироватьПроводкуВыбытияСтоимостиБумагиЕПС(Объект, Движения[УчетныйРегистр], ДанныеБумаги, ДанныеКорСчета, "дисконт");
		
		// премия
		ДанныеБумаги.СчетУчета = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета;
		ДанныеБумаги.ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия;
		ДанныеБумаги.Сумма = ВыборкаДетальныеЗаписи.ПремияНачисленная;
		ДанныеБумаги.СуммаВВалютеУчета = ВыборкаДетальныеЗаписи.ПремияНачисленнаяВВалютеУчета;
		СформироватьПроводкуВыбытияСтоимостиБумагиЕПС(Объект, Движения[УчетныйРегистр], ДанныеБумаги, ДанныеКорСчета, "премия");
		
		// УНКД
		ДанныеБумаги.СчетУчета = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета;
		ДанныеБумаги.ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный;
		ДанныеБумаги.Сумма = ВыборкаДетальныеЗаписи.СтоимостьКупона;
		ДанныеБумаги.СуммаВВалютеУчета = ВыборкаДетальныеЗаписи.СтоимостьКупонаВВалютеУчета;
		СформироватьПроводкуВыбытияСтоимостиБумагиЕПС(Объект, Движения[УчетныйРегистр], ДанныеБумаги, ДанныеКорСчета, "УНКД");
		
		// ННКД
		ДанныеБумаги.СчетУчета = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета;
		ДанныеБумаги.ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный;
		ДанныеБумаги.Сумма = ВыборкаДетальныеЗаписи.ПереоценкаКупона;
		ДанныеБумаги.СуммаВВалютеУчета = ВыборкаДетальныеЗаписи.ПереоценкаКупонаВВалютеУчета;
		СформироватьПроводкуВыбытияСтоимостиБумагиЕПС(Объект, Движения[УчетныйРегистр], ДанныеБумаги, ДанныеКорСчета, "ННКД");
		
		// Переоценка
		ДанныеБумаги.СчетУчета = ?(ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета > 0, ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаПереоценкиА, ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаПереоценкиП);
		ДанныеБумаги.ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги;
		ДанныеБумаги.Сумма = ВыборкаДетальныеЗаписи.Переоценка;
		ДанныеБумаги.СуммаВВалютеУчета = ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета;
		СформироватьПроводкуВыбытияСтоимостиБумагиЕПС(Объект, Движения[УчетныйРегистр], ДанныеБумаги, ДанныеКорСчета, "переоценка");
		
		// Корректировка ЭСП
		ДанныеБумаги.СчетУчета = ?(ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета > 0, ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаКорректировокА, ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаКорректировокП);
		ДанныеБумаги.ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПустаяСсылка();
		ДанныеБумаги.Сумма = ВыборкаДетальныеЗаписи.КорректировкаЭСП;
		ДанныеБумаги.СуммаВВалютеУчета = ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчета;
		СформироватьПроводкуВыбытияСтоимостиБумагиЕПС(Объект, Движения[УчетныйРегистр], ДанныеБумаги, ДанныеКорСчета, "корректировка ЭСП");
		
		// Корректировка ПП
		ДанныеБумаги.СчетУчета = ?(ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета > 0, ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Кт, ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаОтрицательнойРазницыПервоначальногоПризнанияУровень3Дт);
		ДанныеБумаги.ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания;
		ДанныеБумаги.Сумма = ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные;
		ДанныеБумаги.СуммаВВалютеУчета = ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета;
		СформироватьПроводкуВыбытияСтоимостиБумагиЕПС(Объект, Движения[УчетныйРегистр], ДанныеБумаги, ДанныеКорСчета, "корректировка ПП");
		
		// Погашение купона не исполненное в срок
		ДанныеБумаги.СчетУчета = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета;
		ДанныеБумаги.ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПогашениеКупонаНеИсполненноеВСрок;
		ДанныеБумаги.Сумма = ВыборкаДетальныеЗаписи.ПогашениеКупонаНеИсполненноеВСрок;
		ДанныеБумаги.СуммаВВалютеУчета = ВыборкаДетальныеЗаписи.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета;
		СформироватьПроводкуВыбытияСтоимостиБумагиЕПС(Объект, Движения[УчетныйРегистр], ДанныеБумаги, ДанныеКорСчета, "задолженность НКД");
		
		// Сумма резервов под обесценение
		Если ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение <> 0 Тогда
			
			ГФУПриСписании = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.АналитикаСписанияРезервов;
			СчетУчетаРасходов = ПланыСчетов.Единый.НайтиПоКоду(ГФУПриСписании.НомерСчетаБухгалтерскогоУчета);
		
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(Объект, Движения[УчетныйРегистр], ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение, "Выбытие стоимости ценной бумаги(резерв)");	
			
			Проводка.СчетДт = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаРезервов;
			Проводка.СубконтоДт.Резервы = ВыборкаДетальныеЗаписи.Резерв;
			Проводка.СубконтоДт.ЦенныеБумаги = Объект.ЦеннаяБумага;
			Проводка.ВалютаДт = ВалютаУчета;
			Проводка.ВалютнаяСуммаДт = ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение;
			
			Проводка.СчетКт = СчетУчетаРасходов;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУПриСписании;
			Проводка.СубконтоКт.ЦенныеБумаги = Объект.ЦеннаяБумага;
		
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьПроводкиВыбытияСтоимостиБумаги(Объект, Движения, УчетныйРегистр, Отказ) Экспорт

	Движения[УчетныйРегистр].Записывать = Истина;
	
	ДанныеБумаги = Новый Структура("ЦеннаяБумага, СчетУчета, Сумма, СуммаВВалютеУчета, Количество, Валюта, Эмитент, Контрагент");
	ДанныеБумаги.ЦеннаяБумага = Объект.ЦеннаяБумага;
	ДанныеБумаги.Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеБумаги.ЦеннаяБумага, "ВалютаНоминала");
	ДанныеБумаги.Эмитент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеБумаги.ЦеннаяБумага, "Эмитент");
	ДанныеБумаги.Контрагент	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеБумаги.Эмитент, "ЮрФизЛицо");
	
	ДанныеКорСчета = Новый Структура("КоррСчет, Субконто1, Субконто2, Субконто3");
	ЗаполнитьЗначенияСвойств(ДанныеКорСчета, Объект);
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.СнятиеЦеннойБумагиСУчета")
		ИЛИ Объект.КоррСчет = ПланыСчетов.Основной.ПрочиеРасходы Тогда // на всякий случай проставим правильные значения
		
		ОбращаетсяНаОРЦБ = БухгалтерскийУчет.ПолучитьСведенияОбОбращенииЦеннойБумагиНаОРЦБ(Объект.Дата, Объект.ЦеннаяБумага, УчетныйРегистр);
		
	    ДанныеКорСчета.КоррСчет = ПланыСчетов.Основной.ПрочиеРасходы;
		Если НЕ ЗначениеЗаполнено(ДанныеКорСчета.Субконто1) Тогда
			ДанныеКорСчета.Субконто1 = ОбщегоНазначения.ПолучитьИменованныйОбъект("ПДР_ПрекращениеПризнанияОблигацииКорп");
		КонецЕсли;
		ДанныеКорСчета.Субконто2 = Объект.ЦеннаяБумага;
		ДанныеКорСчета.Субконто3 = ОбращаетсяНаОРЦБ;
	
	КонецЕсли;
	
	УчетныйАктив		= БухгалтерскийУчет.ОпределитьУчетныйАктив(Объект.Дата, Объект.Рынок, Объект.ЦеннаяБумага);
	УчетныйАктивКупона	= БухгалтерскийУчет.ОпределитьУчетныйАктив(Объект.Дата, Объект.Рынок, Объект.ЦеннаяБумага, Истина);
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, УчетныйАктив, УчетныйРегистр);		
	НастройкиУчетаКупона = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, УчетныйАктивКупона, УчетныйРегистр);		
		
	//читаем движения партий
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(БухПартииЦенныхБумаг.Количество) КАК Количество,
		|	СУММА(БухПартииЦенныхБумаг.Стоимость) КАК Стоимость,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьВВалютеУчета) КАК СтоимостьВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.Переоценка) КАК Переоценка,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета) КАК ПереоценкаВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьКупона) КАК СтоимостьКупона,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета) КАК СтоимостьКупонаВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаКупона) КАК ПереоценкаКупона,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета) КАК ПереоценкаКупонаВВалютеУчета
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидУчета = &ВидУчета
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)";

	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	Запрос.УстановитьПараметр("ВидУчета",    Перечисления.ВидыУчета[УчетныйРегистр]);

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведение по регистрам бухгалтерии не возможно, т.к. движения по партиям не сформированы",,,, Отказ);
		Возврат;
	ИначеЕсли ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		// Стоимость
		ДанныеБумаги.СчетУчета = НастройкиУчета.СчетУчета;
		ДанныеБумаги.Сумма = ВыборкаДетальныеЗаписи.Стоимость;
		ДанныеБумаги.СуммаВВалютеУчета = ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета;
		ДанныеБумаги.Количество = ВыборкаДетальныеЗаписи.Количество;
		СформироватьПроводкуВыбытияСтоимостиБумаги(Объект, Движения[УчетныйРегистр], ДанныеБумаги, ДанныеКорСчета, "стоимость");
		
		ДанныеБумаги.Количество = 0;
		
		// Переоценка
		ДанныеБумаги.СчетУчета = НастройкиУчета.СчетУчетаПереоценки;
		ДанныеБумаги.Сумма = ВыборкаДетальныеЗаписи.Переоценка;
		ДанныеБумаги.СуммаВВалютеУчета = ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета;
		СформироватьПроводкуВыбытияСтоимостиБумаги(Объект, Движения[УчетныйРегистр], ДанныеБумаги, ДанныеКорСчета, "переоценка");
		
		// Стоимость купона
		ДанныеБумаги.СчетУчета = НастройкиУчетаКупона.СчетУчета;
		ДанныеБумаги.Сумма = ВыборкаДетальныеЗаписи.СтоимостьКупона;
		ДанныеБумаги.СуммаВВалютеУчета = ВыборкаДетальныеЗаписи.СтоимостьКупонаВВалютеУчета;
		СформироватьПроводкуВыбытияСтоимостиБумаги(Объект, Движения[УчетныйРегистр], ДанныеБумаги, ДанныеКорСчета, "УНКД");
		
		// Стоимость купона
		ДанныеБумаги.СчетУчета = НастройкиУчетаКупона.СчетУчетаПереоценки;
		ДанныеБумаги.Сумма = ВыборкаДетальныеЗаписи.ПереоценкаКупона;
		ДанныеБумаги.СуммаВВалютеУчета = ВыборкаДетальныеЗаписи.ПереоценкаКупонаВВалютеУчета;
		СформироватьПроводкуВыбытияСтоимостиБумаги(Объект, Движения[УчетныйРегистр], ДанныеБумаги, ДанныеКорСчета, "ННКД");
		
	КонецЕсли;
	
	Если Объект.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда // Задолженность по погашению купона спишем
	
		СчетЗадолженностиПоПогашениюКупона = ?(Объект.ЦеннаяБумага.Категория = Перечисления.КатегорииОблигаций.Еврооблигация, ПланыСчетов.Основной.ПогашениеКупонаЕврооблигации, ПланыСчетов.Основной.ПогашениеКупона);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухгалтерскийУчетОстатки.Субконто2 КАК ОснованиеРасчетов,
			|	БухгалтерскийУчетОстатки.Валюта КАК Валюта,
			|	БухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток,
			|	БухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток
			|ИЗ
			|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
			|			&Период,
			|			Счет = &СчетЗадолженностиПоПогашениюКупона,
			|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Облигации),
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
			|				И Субконто1 = &Облигация) КАК БухгалтерскийУчетОстатки";
		
		Если Объект.ЦеннаяБумага.Категория = Перечисления.КатегорииОблигаций.Еврооблигация Тогда
			Запрос.УстановитьПараметр("СчетЗадолженностиПоПогашениюКупона", ПланыСчетов.Основной.ПогашениеКупонаЕврооблигации);
		Иначе
			Запрос.УстановитьПараметр("СчетЗадолженностиПоПогашениюКупона", ПланыСчетов.Основной.ПогашениеКупона);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчетОстатки.Субконто2 КАК ОснованиеРасчетов,", ""); // субконто оснавание расчетов есть только у еврооблигаций
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);
		
		Запрос.УстановитьПараметр("Облигация", Объект.ЦеннаяБумага);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("Период", Новый Граница(Объект.МоментВремени(), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(Объект.СчетДоверительногоУправления));
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ДанныеБумаги.СчетУчета = СчетЗадолженностиПоПогашениюКупона;
			ДанныеБумаги.Сумма = ВыборкаДетальныеЗаписи.ВалютнаяСуммаОстаток;
			ДанныеБумаги.СуммаВВалютеУчета = ВыборкаДетальныеЗаписи.СуммаОстаток;
			Если Объект.ЦеннаяБумага.Категория = Перечисления.КатегорииОблигаций.Еврооблигация Тогда
				ДанныеБумаги.Вставить("ОснованиеРасчетов", ВыборкаДетальныеЗаписи.ОснованиеРасчетов);
			КонецЕсли;
			СформироватьПроводкуВыбытияСтоимостиБумаги(Объект, Движения[УчетныйРегистр], ДанныеБумаги, ДанныеКорСчета, "задолженность НКД");
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры
